CREATE TABLE IF NOT EXISTS Δασικές_Πυρκαγιές (
    id SERIAL,
    όνομα_πυρ_σώματος VARCHAR(150),
    ημερομ_έναρξης DATE,
    ώρα_έναρξης TIME,
    ημερομ_κατασβ DATE,
    ώρα_κατασβ TIME,
    καμμένη_έκταση FLOAT,
    πλήθος_προσωπικού INTEGER,
    πλήθος_οχημάτων INTEGER,
    πλήθος_εναέριων_μέσων INTEGER,
    PRIMARY KEY (id)
);

insert into Δασικές_Πυρκαγιές (όνομα_πυρ_σώματος, ημερομ_έναρξης, ώρα_έναρξης, ημερομ_κατασβ, ώρα_κατασβ, καμμένη_έκταση, πλήθος_προσωπικού, πλήθος_οχημάτων, πλήθος_εναέριων_μέσων)
select τμήμα, ημερομηνία_έναρξης, ώρα_έναρξης, ημερομηνία_κατάσβεσης, ώρα_κατάσβεσης, καμμένη_έκταση_στρ, προσωπικό, οχήματα, εναέρια
from fire_temp;

INSERT INTO Δασικές_Πυρκαγιές VALUES (DEFAULT, '6ος Π.Σ. ΑΘΗΝΩΝ','6/24/2013','15:42','6/24/2013','21:10',5.0,13,13,1) ON CONFLICT όνομα_πυρ_σώματος, ημερομ_έναρξης, ώρα_έναρξης, ημερομ_κατασβ, ώρα_κατασβ, καμμένη_έκταση, πλήθος_προσωπικού, πλήθος_οχημάτων, πλήθος_εναέριων_μέσων;
